import './Policy.css'

const Policy = () => {
    return (
			<>
				<div className='privacy-policy'>
					<h1>Политика конфиденциальности</h1>
					<p>
						<strong>Дата вступления в силу:</strong> [01.01.2024]
					</p>
					<p>
						Данная Политика конфиденциальности описывает, какие личные данные
						собирают, используют и хранят <strong>name</strong> в процессе
						предоставления услуг по заказу еды и продуктов через наш веб-сайт
						или мобильное приложение.
					</p>

					<h2>1. СБОР ЛИЧНОЙ ИНФОРМАЦИИ</h2>
					<h3>1.1. Информация, предоставляемая пользователями:</h3>
					<p>
						Мы можем собирать личную информацию, предоставляемую пользователями
						в процессе регистрации, оформления заказа или взаимодействия с нашим
						сервисом. Это может включать в себя имя, адрес электронной почты,
						номер телефона, адрес доставки и другую информацию, необходимую для
						обработки заказов.
					</p>

					<h3>1.2. Автоматически собираемая информация:</h3>
					<p>
						Мы автоматически можем собирать определенную информацию, такую как
						IP-адрес, данные о местоположении, информацию об устройстве и
						использовании нашего сервиса с помощью технологий, таких как файлы
						cookie.
					</p>

					<h2>2. ИСПОЛЬЗОВАНИЕ ИНФОРМАЦИИ</h2>
					<h3>2.1. Обработка заказов:</h3>
					<p>
						Личная информация используется для обработки заказов, взаимодействия
						с пользователями и предоставления им необходимых услуг.
					</p>

					<h3>2.2. Улучшение сервиса:</h3>
					<p>
						Мы можем использовать анализ данных для улучшения качества наших
						услуг, а также для разработки новых функций и возможностей.
					</p>

					<h3>2.3. Маркетинг и реклама:</h3>
					<p>
						При наличии согласия пользователя мы можем использовать его
						контактные данные для отправки информации о новых продуктах, акциях
						и специальных предложениях.
					</p>

					<h2>3. РАЗГЛАШЕНИЕ ЛИЧНОЙ ИНФОРМАЦИИ</h2>
					<h3>3.1. Партнеры и поставщики услуг:</h3>
					<p>
						Мы можем делиться личной информацией с третьими сторонами, такими
						как поставщики услуг и партнеры, для обеспечения выполнения заказов
						и предоставления необходимых услуг.
					</p>

					<h3>3.2. Соблюдение законодательства:</h3>
					<p>
						Мы можем разглашать личную информацию в случае необходимости
						соблюдения законодательства или при получении официального запроса
						от государственных органов.
					</p>

					<h2>4. ЗАЩИТА И БЕЗОПАСНОСТЬ</h2>
					<h3>4.1. Защита данных:</h3>
					<p>
						Мы предпринимаем меры для обеспечения безопасности личной
						информации, включая шифрование данных и использование других
						технических средств.
					</p>

					<h3>4.2. Конфиденциальность платежей:</h3>
					<p>
						Мы сотрудничаем с надежными платежными провайдерами для обеспечения
						безопасности финансовых транзакций.
					</p>

					<h2>5. ПРАВА ПОЛЬЗОВАТЕЛЕЙ</h2>
					<h3>
						5.1. Пользователи имеют право запросить доступ, исправление или
						удаление своей личной информации, а также выразить свое согласие или
						отказ от рекламных коммуникаций.
					</h3>

					<h2>6. ИЗМЕНЕНИЯ В ПОЛИТИКЕ</h2>
					<h3>
						6.1. Мы оставляем за собой право вносить изменения в нашу Политику
						конфиденциальности. Обновленная версия будет доступна на нашем
						веб-сайте.
					</h3>

					<h2>7. КОНТАКТНАЯ ИНФОРМАЦИЯ</h2>
					<p>
						Если у вас есть вопросы или предложения относительно нашей Политики
						конфиденциальности, пожалуйста, свяжитесь с нами по адресу [Указать
						контактные данные].
					</p>
					<p>
						<strong>Дата последнего обновления:</strong> [01.01.2024]
					</p>
				</div>
			</>
		)
}
 
export default Policy;